<a href="https://colab.research.google.com/github/aibees/anaconda_prods/blob/main/chi_square.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
from scipy.stats import chi2_contingency

In [4]:
df = pd.read_csv("financial_info_10k_persons.csv")

In [5]:
df.head()

   ID  is_attrited  Age  ... Credit_limit  Total_trans_amt Total_trans_cnt
0   1            0   41  ...       4953.0             4183              67
1   2            0   38  ...       5983.0             4141              65
2   3            0   57  ...      19482.0             1421              22
3   4            0   57  ...       9149.0            14401             100
4   5            0   63  ...      16312.0             4366              68

[5 rows x 16 columns]

In [6]:
# 성별과 결혼여부 사이 독립성 검정
chi2_contingency(pd.crosstab(df["Gender"], df["Marital_status"]))

(4.093468963560284,
 0.2515464475739655,
 3,
 array([[ 392.8524, 2462.9028, 2067.3924,  392.8524],
        [ 346.1476, 2170.0972, 1821.6076,  346.1476]]))

In [7]:
# 고객이 고졸인 경우 성별과 이탈여부 사용하여 독립성 검정 실시 -> p-value?
df_sub = df.loc[df["Edu_level"] == "High School", ["Gender", "is_attrited"]]

In [8]:
df_sub.head()

   Gender  is_attrited
0       F            0
1       M            0
6       M            0
16      F            0
17      F            0

In [10]:
chi2_contingency(pd.crosstab(df_sub["Gender"], df_sub["is_attrited"]), correction=False)

(3.979589535548525,
 0.04605478481460392,
 1,
 array([[867.82258065, 152.17741935],
        [820.17741935, 143.82258065]]))

In [11]:
# 성별에 따른 카드 등급은 서로 관련 있는지 검정 실시하고 해당 결과의 검정통계량?
result = chi2_contingency(pd.crosstab(df["Gender"], df["Card"]))

In [12]:
result[0]

66.45702170623164

In [13]:
# 최근 12개월 이용실적 중 3개월 이상 사용 실적이 없는 것과 고객 이탈의 관계여부 독립성 검정 실시
df.head()

   ID  is_attrited  Age  ... Credit_limit  Total_trans_amt Total_trans_cnt
0   1            0   41  ...       4953.0             4183              67
1   2            0   38  ...       5983.0             4141              65
2   3            0   57  ...      19482.0             1421              22
3   4            0   57  ...       9149.0            14401             100
4   5            0   63  ...      16312.0             4366              68

[5 rows x 16 columns]

In [14]:
df["Inactive"] = df["Inactive_last_12m"] >= 3

In [15]:
df.head()

   ID  is_attrited  Age  ... Total_trans_amt  Total_trans_cnt Inactive
0   1            0   41  ...            4183               67    False
1   2            0   38  ...            4141               65     True
2   3            0   57  ...            1421               22     True
3   4            0   57  ...           14401              100    False
4   5            0   63  ...            4366               68     True

[5 rows x 17 columns]

In [23]:
result, p, free, e_val = chi2_contingency(pd.crosstab(df["Inactive"], df["is_attrited"]), correction=False)

In [24]:
result

211.54711912617137

In [25]:
free

1

In [26]:
p

6.314428114454069e-48